In [7]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A':['foo','bar','foo','bar','foo','bar','foo','bar',],
                    'B':['one','two','three','one','two','two','one','three',],
                    'C':np.random.randn(8),
                    'D':np.random.randn(8)})
df

     A      B         C         D
0  foo    one  1.221943  0.306332
1  bar    two  1.075531 -0.957467
2  foo  three  0.184587  0.353536
3  bar    one  0.599637  2.225838
4  foo    two  0.334860  0.418115
5  bar    two -0.512830 -1.289441
6  foo    one -0.235172  1.005169
7  bar  three  1.252471  0.807743

In [3]:
g = df.groupby('A')

In [5]:
g.count()

     B  C  D
A
bar  4  4  4
foo  4  4  4

In [46]:
g = df.groupby(['A','B'])
g.count()

           C  D
A   B
bar one    1  1
    three  1  1
    two    2  2
foo one    2  2
    three  1  1
    two    1  1

In [47]:
g.size()

A    B
bar  one      1
     three    1
     two      2
foo  one      2
     three    1
     two      1
dtype: int64

In [10]:
def get_letter_type(letter):
    print(letter)
    if letter.lower() in 'aeiou':
        return 'a'
    else:
        return 'b'
g = df.groupby(get_letter_type,axis=1)
g.count()

A
B
C
D

   a  b
0  1  3
1  1  3
2  1  3
3  1  3
4  1  3
5  1  3
6  1  3
7  1  3

In [14]:
s = pd.Series([1,2,3,1,2,3],[8,7,5,8,7,5])
s

8    1
7    2
5    3
8    1
7    2
5    3
dtype: int64

In [15]:
g = s.groupby(level=0)

In [18]:
g.first()

5    3
7    2
8    1
dtype: int64

In [19]:
g.last()

5    3
7    2
8    1
dtype: int64

In [20]:
g.sum()

5    6
7    4
8    2
dtype: int64

In [21]:
g = s.groupby(level=0,sort=False)
g.first()

8    1
7    2
5    3
dtype: int64

In [22]:
df2 = pd.DataFrame({'X':['A','B','A','B'],
                    'Y':[1,2,3,4]})
df2

   X  Y
0  A  1
1  B  2
2  A  3
3  B  4

In [23]:
df2.groupby(['X']).get_group('A') #focus col

   X  Y
0  A  1
2  A  3

In [26]:
arrays = [['a','b','c','d','a','b','c','d',],
        ['one','two','three','four','one','two','three','four']]
index = pd.MultiIndex.from_arrays(arrays=arrays,names=['first','second'])

In [27]:
s = pd.Series(np.random.randn(8),index=index)
s

first  second
a      one      -1.876412
b      two      -2.083762
c      three     0.861353
d      four      0.066076
a      one       1.884018
b      two      -0.407475
c      three     0.490392
d      four      1.687211
dtype: float64

In [28]:
g = s.groupby(level=0)
g.sum()

first
a    0.007606
b   -2.491236
c    1.351745
d    1.753287
dtype: float64

In [29]:
g = s.groupby(level=1)
g.sum()

second
four     1.753287
one      0.007606
three    1.351745
two     -2.491236
dtype: float64

In [31]:
g = s.groupby(level='first')
g.sum()

first
a    0.007606
b   -2.491236
c    1.351745
d    1.753287
dtype: float64

In [33]:
g = df.groupby(['A','B'])
g.aggregate(np.sum)

                  C         D
A   B
bar one    0.599637  2.225838
    three  1.252471  0.807743
    two    0.562700 -2.246908
foo one    0.986771  1.311501
    three  0.184587  0.353536
    two    0.334860  0.418115

In [34]:
g = df.groupby(['A','B'],as_index=False)
g.aggregate(np.sum)

     A      B         C         D
0  bar    one  0.599637  2.225838
1  bar  three  1.252471  0.807743
2  bar    two  0.562700 -2.246908
3  foo    one  0.986771  1.311501
4  foo  three  0.184587  0.353536
5  foo    two  0.334860  0.418115

In [35]:
df.groupby(['A','B']).sum().reset_index()

     A      B         C         D
0  bar    one  0.599637  2.225838
1  bar  three  1.252471  0.807743
2  bar    two  0.562700 -2.246908
3  foo    one  0.986771  1.311501
4  foo  three  0.184587  0.353536
5  foo    two  0.334860  0.418115

In [37]:
g = df.groupby(['A','B'])
g.size()

A    B
bar  one      1
     three    1
     two      2
foo  one      2
     three    1
     two      1
dtype: int64

In [38]:
g.describe()

              C                      ...         D
          count      mean       std  ...       50%       75%       max
A   B                                ...
bar one     1.0  0.599637       NaN  ...  2.225838  2.225838  2.225838
    three   1.0  1.252471       NaN  ...  0.807743  0.807743  0.807743
    two     2.0  0.281350  1.123141  ... -1.123454 -1.040460 -0.957467
foo one     2.0  0.493385  1.030336  ...  0.655751  0.830460  1.005169
    three   1.0  0.184587       NaN  ...  0.353536  0.353536  0.353536
    two     1.0  0.334860       NaN  ...  0.418115  0.418115  0.418115

[6 rows x 16 columns]

In [42]:
g = df.groupby('A')
g['C'].agg([np.sum,np.mean,np.std])

          sum      mean       std
A
bar  2.414808  0.603702  0.793764
foo  1.506218  0.376554  0.613047

In [45]:
g['C'].agg(res_sum=np.sum,res_mean=np.mean)

      res_sum  res_mean
A
bar  2.414808  0.603702
foo  1.506218  0.376554